// <h1>Интерпретация на показателите на ИТМ</h1>
// <p>Напишете програма, която да изчислява Индекса на Телсната маса и според дадената таблица: <a href="https://bg.wikipedia.org/wiki/Индекс_на_телесната_маса#Интерпретация_на_показателите_на_ИМТ">Интерпретация на показателите на ИМТ</a> да изписва в конзолата съответното състояние на пациента.</p>
// <p>Използвайте подходящи имена на променливи!</p>


const calcBMI = function (kilograms, height) {
return (kilograms / height) ** 2;
};
calcBMI(50, 165);